Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxTram_regdef.h
/** \brief ${LMU_instance_name}Region Upper Address Register */
typedef struct _Ifx_TRAM_RGN_UA_Bits
{
    Ifx_UReg_32Bit reserved_0:5;      /**< \brief [4:0] \internal Reserved */
    Ifx_UReg_32Bit ADDR:24;           /**< \brief [28:5] Region Lower Address - ADDR (rw) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_TRAM_RGN_UA_Bits;

/** \brief ${LMU_instance_name}Safety Control Register */
typedef struct _Ifx_TRAM_SCTRL_Bits
{
    Ifx_UReg_32Bit GED:1;             /**< \brief [0:0] Generate Error in ECC for Data Protection - GED (w) */
    Ifx_UReg_32Bit GEC:1;             /**< \brief [1:1] Generate Error in ECC for Error Correction - GEC (w) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_TRAM_SCTRL_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_tram_union
 * \{   */
/** \brief ${LMU_instance_name}Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_ACCEN0_Bits B;           /**< \brief Bitfield access */
} Ifx_TRAM_ACCEN0;

/** \brief ${LMU_instance_name}Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_ACCEN1_Bits B;           /**< \brief Bitfield access */
} Ifx_TRAM_ACCEN1;

/** \brief ${LMU_instance_name}Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_CLC_Bits B;              /**< \brief Bitfield access */
} Ifx_TRAM_CLC;

/** \brief ${LMU_instance_name}Memory Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_MEMCON_Bits B;           /**< \brief Bitfield access */
} Ifx_TRAM_MEMCON;

/** \brief ${LMU_instance_name}Module ID Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_MODID_Bits B;            /**< \brief Bitfield access */
} Ifx_TRAM_MODID;

/** \brief ${LMU_instance_name}Region Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGNACCEN_RA_Bits B;      /**< \brief Bitfield access */
} Ifx_TRAM_RGNACCEN_RA;

/** \brief ${LMU_instance_name}Region Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGNACCEN_RB_Bits B;      /**< \brief Bitfield access */
} Ifx_TRAM_RGNACCEN_RB;

/** \brief ${LMU_instance_name}Region Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGN_ACCENA_Bits B;       /**< \brief Bitfield access */
} Ifx_TRAM_RGN_ACCENA;

/** \brief ${LMU_instance_name}Region Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGN_ACCENB_Bits B;       /**< \brief Bitfield access */
} Ifx_TRAM_RGN_ACCENB;

/** \brief ${LMU_instance_name}Region Lower Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGN_LA_Bits B;           /**< \brief Bitfield access */
} Ifx_TRAM_RGN_LA;

/** \brief ${LMU_instance_name}Region Upper Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_RGN_UA_Bits B;           /**< \brief Bitfield access */
} Ifx_TRAM_RGN_UA;

/** \brief ${LMU_instance_name}Safety Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_TRAM_SCTRL_Bits B;            /**< \brief Bitfield access */
} Ifx_TRAM_SCTRL;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Tram_RGN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGN object */
typedef volatile struct _Ifx_TRAM_RGN
{
       Ifx_TRAM_RGN_LA                     LA;                     /**< \brief 0, ${LMU_instance_name}Region Lower Address Register*/
       Ifx_TRAM_RGN_UA                     UA;                     /**< \brief 4, ${LMU_instance_name}Region Upper Address Register*/
       Ifx_TRAM_RGN_ACCENA                 ACCENA;                 /**< \brief 8, ${LMU_instance_name}Region Access Enable Register 0*/
       Ifx_TRAM_RGN_ACCENB                 ACCENB;                 /**< \brief C, ${LMU_instance_name}Region Access Enable Register 1*/
} Ifx_TRAM_RGN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Tram_RGNACCEN_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief RGNACCEN object */
typedef volatile struct _Ifx_TRAM_RGNACCEN
{
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 0, \internal Reserved */
       Ifx_TRAM_RGNACCEN_RA                RA;                     /**< \brief 8, ${LMU_instance_name}Region Access Enable Register 0*/
       Ifx_TRAM_RGNACCEN_RB                RB;                     /**< \brief c, ${LMU_instance_name}Region Access Enable Register 1*/
} Ifx_TRAM_RGNACCEN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxLld_Tram_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief TRAM object */
typedef volatile struct _Ifx_TRAM
{
       Ifx_TRAM_CLC                        CLC;                    /**< \brief 0, ${LMU_instance_name}Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_TRAM_MODID                      MODID;                  /**< \brief 8, ${LMU_instance_name}Module ID Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_TRAM_ACCEN0                     ACCEN0;                 /**< \brief 10, ${LMU_instance_name}Access Enable Register 0*/
       Ifx_TRAM_ACCEN1                     ACCEN1;                 /**< \brief 14, ${LMU_instance_name}Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_18[8];         /**< \brief 18, \internal Reserved */
       Ifx_TRAM_MEMCON                     MEMCON;                 /**< \brief 20, ${LMU_instance_name}Memory Control Register*/
       Ifx_TRAM_SCTRL                      SCTRL;                  /**< \brief 24, ${LMU_instance_name}Safety Control Register*/
       Ifx_UReg_8Bit                       reserved_28[40];        /**< \brief 28, \internal Reserved */
       Ifx_TRAM_RGN                        RGN[8];                 /**< \brief 50, ${LMU_instance_name}Region Access Enable Register 1*/
       Ifx_TRAM_RGNACCEN                   RGNACCEN[8];            /**< \brief D0, */
       Ifx_UReg_8Bit                       reserved_150[32432];    /**< \brief 150, \internal Reserved */
} Ifx_TRAM;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXTRAM_REGDEF_H */
